benchmarks/casesOF/2D/standingCapillaryWave/Cases/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.0015;

//L #calc "1";
//H #calc "3";
//W #calc "0.25";
//L #calc "-1";
//H #calc "3";
//W #calc "0.25";

vertices
  (
   (-1 -0.25 -3) //0
   (1 -0.25 -3) //1
   (1 0.25 -3) //2
   (-1 0.25 -3) //3 
   (-1 -0.25 3) //4
   (1 -0.25 3) //5
   (1 0.25 3) //6
   (-1 0.25 3) //7
   );

blocks
  (
   hex (0 1 2 3 4 5 6 7) (32 8 96) simpleGrading (1 1 1)
   );

edges
  (
  );

boundary
(
    walls
    {
        type wall;
        faces
        (
	 (0 1 2 3)
	 (4 5 6 7)
        );
    }

    left
    {
      type            cyclic;
      neighbourPatch  right;
      faces
        (
	 (0 3 4 7)
	 );
    }

    right
    {
        type            cyclic;
	neighbourPatch  left;
        faces
        (
	 (1 2 5 6)
        );
    }

    front
    {
        type            empty;
	//neighbourPatch  back;        
        faces
        (
	 (0 1 4 5)
	 );
    }

    back
    {
        type            empty;
	//neighbourPatch  front;                
        faces
        (
	 (2 3 6 7)
	 );
    }
);



mergePatchPairs
(
);

// ************************************************************************* //
