benchmarks/casesOF/2D/standingCapillaryWave/Cases/baseCase/system/sampleDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

interpolationScheme cellPoint;

setFormat     raw;

surfaceFormat raw;

surfaces
(

    constantIso
    {
        type isoSurfaceCell;
        isoField alpha.water;
        isoValue 0.5;
        interpolate true;
    }

);

fields
(
   alpha.water
);
